Revit 2027 API
ParameterTypeId.RbsElecMaxCircuitsDataPanel Property
 "Maximum Amount of Circuits"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RbsElecMaxCircuitsDataPanel { get; }
Public Shared ReadOnly Property RbsElecMaxCircuitsDataPanel As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RbsElecMaxCircuitsDataPanel {
	ForgeTypeId^ get ();
}
static member RbsElecMaxCircuitsDataPanel : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace